Revit 2027 API
RebarConstraint.HasAnEdgeNumber Method
 Checks if the getTargetRebarEdgeNumber method can be called for the RebarConstraint.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasAnEdgeNumber()
Public Function HasAnEdgeNumber As Boolean
public:
bool HasAnEdgeNumber()
member HasAnEdgeNumber : unit -> bool
Return Value
Boolean
Remarks
 The RebarConstraintType of the RebarConstraint must be 'ToOtherRebar,' and the TargetRebarConstraintType must be 'Edge' or 'BarBend'.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace